Rides by:
  - month
  - time of day
  - day of week
  - general trend by days of month

In [1]:
import pandas as pd
import numpy as np
import math

In [2]:
uber_apr14 = pd.read_csv('data/uber/uber-raw-data-apr14.csv')
uber_may14 = pd.read_csv('data/uber/uber-raw-data-may14.csv')
uber_jun14 = pd.read_csv('data/uber/uber-raw-data-jun14.csv')
uber_jul14 = pd.read_csv('data/uber/uber-raw-data-jul14.csv')
uber_aug14 = pd.read_csv('data/uber/uber-raw-data-aug14.csv')
uber_sep14 = pd.read_csv('data/uber/uber-raw-data-sep14.csv')
uber_14 = pd.concat([uber_apr14, uber_may14, uber_jun14, uber_jul14, uber_aug14, uber_sep14])

In [3]:
uber_15 = pd.read_csv('data/uber/uber-raw-data-janjune-15.csv')

## Group by month, day of month, day of year

### 2014 april-sept

In [4]:
uber_14.head()

          Date/Time      Lat      Lon    Base
0  4/1/2014 0:11:00  40.7690 -73.9549  B02512
1  4/1/2014 0:17:00  40.7267 -74.0345  B02512
2  4/1/2014 0:21:00  40.7316 -73.9873  B02512
3  4/1/2014 0:28:00  40.7588 -73.9776  B02512
4  4/1/2014 0:33:00  40.7594 -73.9722  B02512

In [5]:
uber_14["month"] = uber_14["Date/Time"].apply(lambda x: int(x[0:1]))
uber_14["day_of_month"] = uber_14["Date/Time"].apply(lambda x: int(x.split("/")[1]))
uber_14["day_of_year"] = uber_14["Date/Time"].apply(lambda x: x.split(" ")[0])
uber_14.head()

          Date/Time      Lat      Lon    Base  month  day_of_month day_of_year
0  4/1/2014 0:11:00  40.7690 -73.9549  B02512      4             1    4/1/2014
1  4/1/2014 0:17:00  40.7267 -74.0345  B02512      4             1    4/1/2014
2  4/1/2014 0:21:00  40.7316 -73.9873  B02512      4             1    4/1/2014
3  4/1/2014 0:28:00  40.7588 -73.9776  B02512      4             1    4/1/2014
4  4/1/2014 0:33:00  40.7594 -73.9722  B02512      4             1    4/1/2014

In [6]:
uber_14["month"].value_counts()

9    1028136
8     829275
7     796121
6     663844
5     652435
4     564516
Name: month, dtype: int64

In [7]:
uber_14["day_of_month"].value_counts().head()

30    167160
12    160606
16    158921
13    156892
23    156032
Name: day_of_month, dtype: int64

In [8]:
uber_14["day_of_year"].value_counts().head()

9/13/2014    43205
9/5/2014     42319
9/19/2014    41017
9/6/2014     40520
9/18/2014    40274
Name: day_of_year, dtype: int64

### 2015 jan-jun

In [9]:
uber_15.head()

  Dispatching_base_num          Pickup_date Affiliated_base_num  locationID
0               B02617  2015-05-17 09:47:00              B02617         141
1               B02617  2015-05-17 09:47:00              B02617          65
2               B02617  2015-05-17 09:47:00              B02617         100
3               B02617  2015-05-17 09:47:00              B02774          80
4               B02617  2015-05-17 09:47:00              B02617          90

In [10]:
uber_15["month"] = uber_15["Pickup_date"].apply(lambda x: int(x[5:7]))
uber_15["day_of_month"] = uber_15["Pickup_date"].apply(lambda x: int(x[8:10]))
uber_15["day_of_year"] = uber_15["Pickup_date"].apply(lambda x: x.split(" ")[0])
uber_15.head()

,Dispatching_base_num,Pickup_date,Affiliated_base_num,locationID,month,day_of_month,day_of_year
0,B02617,2015-05-17 09:47:00,B02617,141,5,17,2015-05-17
1,B02617,2015-05-17 09:47:00,B02617,65,5,17,2015-05-17
2,B02617,2015-05-17 09:47:00,B02617,100,5,17,2015-05-17
3,B02617,2015-05-17 09:47:00,B02774,80,5,17,2015-05-17
4,B02617,2015-05-17 09:47:00,B02617,90,5,17,2015-05-17

In [11]:
uber_15["month"].value_counts()

6    2816895
5    2695553
4    2280837
2    2263620
3    2259773
1    1953801
Name: month, dtype: int64

In [12]:
uber_15["day_of_month"].value_counts().head()

20    524707
14    505901
28    500914
21    494752
16    492225
Name: day_of_month, dtype: int64

In [13]:
uber_15["day_of_year"].value_counts().head()

2015-06-27    136193
2015-05-16    121557
2015-04-25    106270
2015-05-02    104978
2015-05-30    104429
Name: day_of_year, dtype: int64

## By Day of week

In [14]:
def zeller(y, m, q):
    if m <= 2:
        m = 12 + m
        y = y - 1
    K = y % 100
    J = y // 100
    return (q + math.floor((13 * (m + 1))/5) + K + math.floor(K/4) + math.floor(J/4) - 2 * J) % 7

def getDayofWeek(dateString, year):
    date = dateString.split(" ")[0]
    daysOfWeek = ["Sat", "Sun", "Mon", "Tue", "Wed", "Thu", "Fri"]
    if(year == 2014):
        dateParse = date.split("/")
        m = int(dateParse[0])
        q = int(dateParse[1])
        y = int(dateParse[2]) 
    else:
        dateParse = date.split("-")
        m = int(dateParse[1])
        q = int(dateParse[2])
        y = int(dateParse[0])
    z = zeller(y, m, q)
    return daysOfWeek[z]

### 2014

In [15]:
uber_14["day_of_week"] = uber_14["Date/Time"].apply(lambda x: getDayofWeek(x, 2014))
uber_14.head()

,Date/Time,Lat,Lon,Base,month,day_of_month,day_of_year,day_of_week
0,4/1/2014 0:11:00,40.7690,-73.9549,B02512,4,1,4/1/2014,Tue
1,4/1/2014 0:17:00,40.7267,-74.0345,B02512,4,1,4/1/2014,Tue
2,4/1/2014 0:21:00,40.7316,-73.9873,B02512,4,1,4/1/2014,Tue
3,4/1/2014 0:28:00,40.7588,-73.9776,B02512,4,1,4/1/2014,Tue
4,4/1/2014 0:33:00,40.7594,-73.9722,B02512,4,1,4/1/2014,Tue

In [16]:
uber_14["day_of_week"].value_counts()

Thu    755145
Fri    741139
Wed    696488
Tue    663789
Sat    646114
Mon    541472
Sun    490180
Name: day_of_week, dtype: int64

### 2015

In [17]:
uber_15["day_of_week"] = uber_15["Pickup_date"].apply(lambda x: getDayofWeek(x, 2015))
uber_15.head()

,Dispatching_base_num,Pickup_date,Affiliated_base_num,locationID,month,day_of_month,day_of_year,day_of_week
0,B02617,2015-05-17 09:47:00,B02617,141,5,17,2015-05-17,Sun
1,B02617,2015-05-17 09:47:00,B02617,65,5,17,2015-05-17,Sun
2,B02617,2015-05-17 09:47:00,B02617,100,5,17,2015-05-17,Sun
3,B02617,2015-05-17 09:47:00,B02774,80,5,17,2015-05-17,Sun
4,B02617,2015-05-17 09:47:00,B02617,90,5,17,2015-05-17,Sun

In [18]:
uber_15["day_of_week"].value_counts()

Sat    2414563
Fri    2282571
Thu    2159598
Sun    1952782
Wed    1893811
Tue    1872902
Mon    1694252
Name: day_of_week, dtype: int64

## By Time of Day

In [19]:
def getHour(date):
    time = date.split(" ")[1]
    hour = time.split(":")[0]
    return int(hour)

### 2014

In [20]:
uber_14["hour_of_day"] = uber_14["Date/Time"].apply(lambda x: getHour(x))
uber_14.head()

,Date/Time,Lat,Lon,Base,month,day_of_month,day_of_year,day_of_week,hour_of_day
0,4/1/2014 0:11:00,40.7690,-73.9549,B02512,4,1,4/1/2014,Tue,0
1,4/1/2014 0:17:00,40.7267,-74.0345,B02512,4,1,4/1/2014,Tue,0
2,4/1/2014 0:21:00,40.7316,-73.9873,B02512,4,1,4/1/2014,Tue,0
3,4/1/2014 0:28:00,40.7588,-73.9776,B02512,4,1,4/1/2014,Tue,0
4,4/1/2014 0:33:00,40.7594,-73.9722,B02512,4,1,4/1/2014,Tue,0

In [21]:
uber_14["hour_of_day"].value_counts()

17    336190
18    324679
16    313400
19    294513
20    284604
21    281460
15    275466
22    241858
14    230625
13    195877
7     193094
8     190504
12    170452
23    169190
11    165703
9     159967
10    159148
6     143213
0     103836
5      83939
1      67227
4      55230
3      48287
2      45865
Name: hour_of_day, dtype: int64

### 2015

In [22]:
uber_15["hour_of_day"] = uber_15["Pickup_date"].apply(lambda x: getHour(x))
uber_15.head()

,Dispatching_base_num,Pickup_date,Affiliated_base_num,locationID,month,day_of_month,day_of_year,day_of_week,hour_of_day
0,B02617,2015-05-17 09:47:00,B02617,141,5,17,2015-05-17,Sun,9
1,B02617,2015-05-17 09:47:00,B02617,65,5,17,2015-05-17,Sun,9
2,B02617,2015-05-17 09:47:00,B02617,100,5,17,2015-05-17,Sun,9
3,B02617,2015-05-17 09:47:00,B02774,80,5,17,2015-05-17,Sun,9
4,B02617,2015-05-17 09:47:00,B02617,90,5,17,2015-05-17,Sun,9

In [23]:
uber_15["hour_of_day"].value_counts()

19    1007464
18     987093
20     948574
21     930462
22     922954
17     863990
23     814789
16     737170
15     649414
0      602178
9      593437
14     584463
8      583348
13     537909
12     533021
10     520092
11     516716
7      443543
1      394510
6      288533
2      260603
5      193523
3      183655
4      173038
Name: hour_of_day, dtype: int64

## Convert to Excel

### By Day of Month

In [24]:
writer = pd.ExcelWriter("visualizations/uber_day_of_month.xlsx")

In [25]:
day_of_month14 = uber_14["day_of_month"].value_counts().sort_index().to_frame()
day_of_month14.head()

   day_of_month
1        127430
2        143201
3        142983
4        140923
5        147054

In [26]:
day_of_month14.to_excel(writer, index=True, sheet_name="2014")

In [27]:
day_of_month15 = uber_15["day_of_month"].value_counts().sort_index().to_frame()
day_of_month15.head()

   day_of_month
1        462527
2        444579
3        449913
4        411770
5        439934

In [28]:
day_of_month15.to_excel(writer, index=True, sheet_name="2015")

In [29]:
writer.save()

### By Day of Year

In [30]:
writer = pd.ExcelWriter("visualizations/uber_day_of_year.xlsx")

In [31]:
day_of_year14 = uber_14["day_of_year"].value_counts().sort_index().to_frame()
day_of_year14.head()

           day_of_year
4/1/2014         14546
4/10/2014        20041
4/11/2014        20420
4/12/2014        18170
4/13/2014        12112

In [32]:
day_of_year14.to_excel(writer, index=True, sheet_name="2014")

In [33]:
day_of_year15 = uber_15["day_of_year"].value_counts().sort_index().to_frame()
day_of_year15.head()

            day_of_year
2015-01-01        58045
2015-01-02        40287
2015-01-03        59844
2015-01-04        41943
2015-01-05        43678

In [34]:
day_of_year15.to_excel(writer, index=True, sheet_name="2015")

In [35]:
writer.save()

### By Average ride for day of month

In [36]:
writer = pd.ExcelWriter("visualizations/uber_avg_day_of_month.xlsx")

In [37]:
day_of_year14["avg_day_of_month"] = day_of_year14.index.map(lambda x: int(x.split("/")[1]))
day_of_year14.head()

           day_of_year  avg_day_of_month
4/1/2014         14546                 1
4/10/2014        20041                10
4/11/2014        20420                11
4/12/2014        18170                12
4/13/2014        12112                13

In [38]:
avg_day_of_month14 = day_of_year14.groupby("avg_day_of_month").mean()
avg_day_of_month14.head()

                   day_of_year
avg_day_of_month
1                 21238.333333
2                 23866.833333
3                 23830.500000
4                 23487.166667
5                 24509.000000

In [39]:
avg_day_of_month14 = avg_day_of_month14.rename(columns={"day_of_year":"rides"})
avg_day_of_month14.head()

                         rides
avg_day_of_month
1                 21238.333333
2                 23866.833333
3                 23830.500000
4                 23487.166667
5                 24509.000000

In [40]:
avg_day_of_month14.to_excel(writer, index=True, sheet_name="2014")

In [41]:
day_of_year15["avg_day_of_month"] = day_of_year15.index.map(lambda x: int(x.split("-")[2]))
day_of_year15.head()

            day_of_year  avg_day_of_month
2015-01-01        58045                 1
2015-01-02        40287                 2
2015-01-03        59844                 3
2015-01-04        41943                 4
2015-01-05        43678                 5

In [42]:
avg_day_of_month15 = day_of_year15.groupby("avg_day_of_month").mean()
avg_day_of_month15.head()

                   day_of_year
avg_day_of_month
1                 77087.833333
2                 74096.500000
3                 74985.500000
4                 68628.333333
5                 73322.333333

In [43]:
avg_day_of_month15 = avg_day_of_month15.rename(columns={"day_of_year":"rides"})
avg_day_of_month15.head()

                         rides
avg_day_of_month
1                 77087.833333
2                 74096.500000
3                 74985.500000
4                 68628.333333
5                 73322.333333

In [44]:
avg_day_of_month15.to_excel(writer, index=True, sheet_name="2015")

In [45]:
writer.save()

### Day of Week

In [46]:
writer = pd.ExcelWriter("visualizations/uber_day_of_week.xlsx")

In [47]:
day_of_week14 = uber_14["day_of_week"].value_counts().to_frame()

In [48]:
day_of_week14.to_excel(writer, index=True, sheet_name="2014")

In [49]:
day_of_week15 = uber_15["day_of_week"].value_counts().to_frame()

In [50]:
day_of_week15.to_excel(writer, index=True, sheet_name="2015")

In [51]:
writer.save()

### Hour of Day

In [52]:
writer = pd.ExcelWriter("visualizations/uber_hour_of_day.xlsx")

In [53]:
hour_of_day14 = uber_14["hour_of_day"].value_counts().sort_index().to_frame()

In [54]:
hour_of_day14.to_excel(writer, index=True, sheet_name="2014")

In [55]:
hour_of_day15 = uber_15["hour_of_day"].value_counts().sort_index().to_frame()

In [56]:
hour_of_day15.to_excel(writer, index=True, sheet_name="2015")

In [57]:
writer.save()

## Sankey Parse

In [59]:
by_day_by_hour14 = uber_14.groupby(["day_of_week", "hour_of_day"]).size()
by_day_by_hour14.head()

day_of_week  hour_of_day
Fri          0              13716
             1               8163
             2               5350
             3               6930
             4               8806
dtype: int64

In [60]:
by_day_by_hour15 = uber_15.groupby(["day_of_week", "hour_of_day"]).size()
by_day_by_hour15.head()

day_of_week  hour_of_day
Fri          0              85939
             1              46616
             2              28102
             3              19518
             4              23575
dtype: int64

In [61]:
by_day_by_hour14.to_json("visualizations/by_day_by_hour14.json", orient="split")

In [62]:
by_day_by_hour15.to_json("visualizations/by_day_by_hour15.json", orient="split")